In [3]:
import pandas as pd #try install pandas using pip: pip install panads

In [5]:
import numpy as np

In [9]:
s=pd.Series(np.random.random(5)) #randomly gerating

In [10]:
s

0    0.666876
1    0.056356
2    0.331215
3    0.477125
4    0.603655
dtype: float64

In [14]:
s[0:] #slicing

0    0.666876
1    0.056356
2    0.331215
3    0.477125
4    0.603655
dtype: float64

In [15]:
s[3] #indexing

0.4771254837181277

In [21]:
s[0]=34

In [23]:
s

0    34.000000
1     0.056356
2     0.331215
3     0.477125
4     0.603655
dtype: float64

In [25]:
#changing the index

s.index=['1','2','3','4','5']

In [27]:
s

1    34.000000
2     0.056356
3     0.331215
4     0.477125
5     0.603655
dtype: float64

In [29]:
r=pd.Series(np.random.random(4),index=["a",'b','c','d'])

In [31]:
r

a    0.894928
b    0.719738
c    0.857922
d    0.462774
dtype: float64

In [33]:
r.argmax()

0

In [35]:
r.argmin()

3

# Dataframes

In [36]:
e=pd.Series(np.random.random(5))
r=pd.Series(np.random.random(5))

In [38]:
e,r

(0    0.956145
 1    0.948200
 2    0.572831
 3    0.299210
 4    0.274557
 dtype: float64,
 0    0.116847
 1    0.894700
 2    0.719835
 3    0.287415
 4    0.954416
 dtype: float64)

In [41]:
#creating a dataframes using Series object

a=pd.DataFrame([e,r])

In [43]:
a

          0       1         2         3         4
0  0.956145  0.9482  0.572831  0.299210  0.274557
1  0.116847  0.8947  0.719835  0.287415  0.954416

In [45]:
#create a data frame with the help of dictionary

q={'name':['a','b','c'],'age':[23,56,67]}

In [52]:
data=pd.DataFrame(q)
data

  name  age
0    a   23
1    b   56
2    c   67

In [54]:
type(data)

pandas.core.frame.DataFrame

In [57]:
#create a data frame using list

w=[1,2,3,4]
u=[5,6,7,8]

pd.DataFrame([w,u])

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [60]:
#Giving Column name to data
data['gender']=['male','female','male']

In [62]:
data

  name  age  gender
0    a   23    male
1    b   56  female
2    c   67    male

In [64]:
#iloc func(index location) retrives the data by index loxation

data.iloc[1]

name           b
age           56
gender    female
Name: 1, dtype: object

In [67]:
data['name']

0    a
1    b
2    c
Name: name, dtype: object

In [69]:
data.gender

0      male
1    female
2      male
Name: gender, dtype: object

In [71]:
data

  name  age  gender
0    a   23    male
1    b   56  female
2    c   67    male

In [72]:
#extract the value from data form

In [75]:
data.iloc[2,1]

67

In [78]:
data.iloc[0,2]

'male'

In [80]:
data.shape #dimension of data

(3, 3)

In [86]:
data.columns

Index(['name', 'age', 'gender'], dtype='object')

In [88]:
data.dtypes

name      object
age        int64
gender    object
dtype: object

In [90]:
#Return a boolean same-sized object indicating if the values are NA

data.isna()

    name    age  gender
0  False  False   False
1  False  False   False
2  False  False   False

In [92]:
data.isna().sum()

name      0
age       0
gender    0
dtype: int64

In [95]:
#drop-func

data.drop(columns=['age'],axis=1)

  name  gender
0    a    male
1    b  female
2    c    male

In [96]:
data.duplicated()

0    False
1    False
2    False
dtype: bool